## where to install homebrew-cask applications
cask_args appdir: '/Applications'

# set-up brew with taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"

brew "readline"
brew "coreutils"
brew "ffmpeg"
brew "git"
brew "grc"
brew "libgit2"
brew "mkvtoolnix"
brew "php-code-sniffer"
brew "php-cs-fixer"
brew "qpdf"
brew "tldr"
brew "wget"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"

# macOS App Store
mas "1Blocker (1.4.8)", id: 1107421413
mas "1Password 7 - Password Manager (7.4.1)", id: 1333542190
mas "AutoMounter (1.6.5)", id: 1160435653
mas "Cardhop (1.3.2)", id: 1290358394
mas "Fantastical (2.5.13)", id: 975937182
mas "GhosteryLite (1.0.0)", id: 1436953057
mas "I Love Stars (4.4.1)", id: 402642760
mas "Movist (2.1.8)", id: 461788075
mas "Paprika Recipe Manager 3 (3.4.0)", id: 1303222628
mas "PCalc (4.7)", id: 403504866
mas "PhotoSweeper (3.5.0)", id: 463362050
mas "Pixelmator Pro (1.5.3)", id: 1289583905
mas "Remote Desktop (3.9.3)", id: 409907375
mas "Sip (4.5.2)", id: 507257563
mas "The Unarchiver (4.1.0)", id: 425424353
mas "Tweetbot (3.3.3)", id: 1384080005

# Other
cask "acorn"
cask "adium"
cask "alfred"
cask "backblaze"
cask "backblaze-downloader"
cask "bbedit"

# BetterZipQL extends macOS's Quick Look functionality to let you inspect the contents of compressed archives.
# https://macitbetter.com/BetterZip-Quick-Look-Generator/
cask "betterzip"

cask "composercat"
cask "discord"
cask "fake"
cask "firefox"
cask "flickr-uploadr"
cask "fluid"
cask "google-chrome"
cask "handbrake"
cask "kaleidoscope"
cask "knox"
cask "launchcontrol"
cask "microsoft-excel"
#cask "microsoft-powerpoint"
cask "microsoft-word"
cask "moom"
cask "omnidisksweeper"
cask "pdfpenpro"
cask "phpstorm"
cask "postbox"

# QLColorCode is a Quick Look plugin that renders source code with syntax highlighting.
# https://github.com/anthonygelibert/QLColorCode
cask "qlcolorcode"

# qlImageSize displays the dimensions and size of an image in the title bar instead of the filename.
# https://github.com/Nyx0uf/qlImageSize
cask "qlimagesize"


# QuickLookJSON is a useful quick look plugin to preview JSON files.
# http://www.sagtau.com/quicklookjson.html
cask "quicklook-json"

# QLMarkdown is a simple QuickLook generator for Markdown files.
# https://github.com/toland/qlmarkdown
cask "qlmarkdown"

# QLStephen is a QuickLook plugin that lets you view plain text files without a file extension.
# Files like: README, INSTALL, Capfile, CHANGELOG, etc…
# https://github.com/whomwah/qlstephen
cask "qlstephen"

# QLVideo allows macOS Finder to display thumbnails, static previews, cover art and metadata for most types of video files.
# https://github.com/Marginal/QLVideo
cask "qlvideo"

cask "querious"
cask "quicklook-json"
cask "ringcentral"
#cask "safari-technology-preview"
cask "sequel-pro"
cask "slack"
cask "stoplight-studio"
cask "suspicious-package"
cask "telegram"
#cask "transmission"
#cask "transmission-interface-binder"
cask "transmit"
cask "virtualbox"
cask "vlc"
cask "wavebox"
cask "webpquicklook"
cask "zoomus"
